Revit 2026 API

# TableSectionDataSetCellStyle(Int32, Int32, TableCellStyle) Method

---

Sets a cell's style

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCellStyle(
	int nRow,
	int nCol,
	TableCellStyle Style
)
```
```vb
Public Sub SetCellStyle (
	nRow As Integer,
	nCol As Integer,
	Style As TableCellStyle
)
```
```cpp
public:
void SetCellStyle(
	int nRow,
	int nCol,
	TableCellStyle^ Style
)
```
```fsharp
member SetCellStyle :
        nRow : int *
        nCol : int *
        Style : TableCellStyle -> unit
```

#### Parameters

nRow Int32

nCol Int32

Style TableCellStyle

| Exception | Condition |
| --- | --- |
| ArgumentException | The given row number nRow is invalid. -or- The given column number nCol is invalid. -or- Only allow to override cell style for header section or column header in body section. |
| ArgumentNullException | A non-optional argument was null |

For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this cell. The global base format controls any non-overridden characteristics of this cell.

#### Reference

TableSectionData Class

SetCellStyle Overload

Autodesk.Revit.DB Namespace